In [1]:
import pandas as pd
import numpy as np

In [2]:
f_2015 = pd.read_csv("C:/Users/user/Desktop/Python_Main/kurs_pandas/Fortune_500_2015.csv",
                    usecols=["rank","company"])

In [3]:
f_2016 = pd.read_csv("C:/Users/user/Desktop/Python_Main/kurs_pandas/Fortune_500_2016.csv",
                    usecols=["rank","company"])

In [7]:
companies_2015_2016 = f_2015.merge(f_2016,on = "company",suffixes=('rank_2015','rank_2016'),how = "outer",indicator=True)

In [8]:
companies_2015_2016[companies_2015_2016["company"] =="Microsoft"]

    rankrank_2015    company  rankrank_2016 _merge
30           31.0  Microsoft           25.0   both

In [9]:
companies_2015_2016

     rankrank_2015                   company  rankrank_2016      _merge
0              1.0                   Walmart            1.0        both
1              2.0               Exxon Mobil            2.0        both
2              3.0                   Chevron           14.0        both
3              4.0        Berkshire Hathaway            4.0        both
4              5.0                     Apple            3.0        both
..             ...                       ...            ...         ...
529            NaN  Telephone & Data Systems          496.0  right_only
530            NaN  First American Financial          497.0  right_only
531            NaN                       NVR          498.0  right_only
532            NaN      Cincinnati Financial          499.0  right_only
533            NaN         Burlington Stores          500.0  right_only

[534 rows x 4 columns]